In [1]:
import seaborn as sns
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [15]:
# deck열에 누락데이터(NaN) 688개 확인
# deck 종류별 value 개수 확인 가능

nan_deck = df['deck'].value_counts(dropna=False)
nan_deck

deck
NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: count, dtype: int64

In [17]:
# 누락데이터를 직접 착는 방법으로 isnull(), notnull()이 있다.
## isnull() : 누락 데이터면 True반환, 유효데이터면 False반환
## notnull() : 유효데이터면 True반환, 누락데이터면 False반환

df.head().notnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
1,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True
3,True,True,True,True,True,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,True,True,False,True,True,True

In [18]:
# isnull()의 경우 반환되는 값이 참이면 1, 거짓이면 0으로 판별한다.

df.head().isnull().sum(axis=0)  # 참(1)의 합을 구한다.

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           3
embark_town    0
alive          0
alone          0
dtype: int64

# 누락 데이터 제거

In [19]:
import seaborn as sns

# titanic 데이터셋 가져오기
df = sns.load_dataset('titanic')

# for 반복문으로 각 열의 NaN 개수 계산하기
missing_df = df.isnull()
for col in missing_df.columns:
    missing_count = missing_df[col].value_counts()  # 각 열의 NaN 개수 확인
    try:
        print(col, "; ", missing_count[True])   # NaN값이 있다면 개수 출력
    except:
        print(col, "; ", 0) # NaN 이 없다면 0 출력

survived ;  0
pclass ;  0
sex ;  0
age ;  177
sibsp ;  0
parch ;  0
fare ;  0
embarked ;  2
class ;  0
who ;  0
adult_male ;  0
deck ;  688
embark_town ;  2
alive ;  0
alone ;  0

In [20]:
# NaN 값이 500개 이상인 열을 모두 삭제하여 분석 대상에서 제외한다. (누락 데이터의 차지 비율이 높기 때문)
df_thresh = df.dropna(axis=1, thresh=500)
df_thresh.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

# 누락 데이터 치환
* 일부가 누락되어있더라도 나머지 데이터를 최대한 살려서 데이터 분석에 활용 하는 것이 좋은 결과를 얻는 팁
* 누락 데이터를 대체할 값의 예시 : 평균값, 최빈값 - fillna()로 처리 가능
* fillna() : 새로운 객체를 반환, 원본 객체를 변경하려면 inplace=True 옵션을 추가해야한다.

titanic데이터의 age열 누락데이터 평균값으로 채우기

In [8]:
import seaborn as sns

df = sns.load_dataset('titanic')

# age행 처음 10개 항목 확인 가능
print(df['age'].head(10))
print("==========================")

# age열의 NaN값을 다른 나이 데이터의 평균으로 변경하기
mean_age = df['age'].mean(axis=0)   # age열의 평균값(NaN 제외)
df['age'].fillna(mean_age, inplace=True)

print(df['age'].head(10))

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64
==========================
0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

titanic 데이터의 승선 도시를 나타내는 'embark_town'열에 있는 NaN을 다른 값으로 바꾼다.  
승객들이 가장 많이 승선한 도시의 이름을 찾아 NaN을 치환한다.  
* value_counts() => 승선도시별 승객수 찾기
* idxmax() => 가장 큰 값을 갖는 도시(Southampton)을 찾는다.
* 결과, 누락 데이터들이 Southampton으로 변경된다.

In [27]:
import seaborn as sns

df = sns.load_dataset('titanic')

# embarked열의 NaN 출력
print(df['embarked'][825:830])

# 최빈값 확인하기
print(df['embarked'].value_counts())

# embarked열의 NaN값을 승선도시 중에서 가장 많이 출현한 값으로 치환하기
most_freq = df['embarked'].value_counts(dropna=True).idxmax()
print(most_freq)

df['embarked'].fillna(most_freq, inplace=True)

# 최빈값으로 대체된 것 확인하기
print(df['embarked'][825:830])

825      Q
826      S
827      C
828      Q
829    NaN
Name: embarked, dtype: object
embarked
S    644
C    168
Q     77
Name: count, dtype: int64
S
825    Q
826    S
827    C
828    Q
829    S
Name: embarked, dtype: object

##### 누락데이터가 NaN으로 표시되지 않은 경우
* 데이터셋 중에는 누락데이터가 NaN으로 입력되지 않고 0이나 -, ?로 입력되기도 한다.
* pandas에서 누락데이터를 다루려면 replace()를 활용하여 numpy에서 지원하는 np.nan으로 변경해주는 것이 좋다.
* 예시 : df.replace('?', np.nan, inplace=True)

### 이웃하고있는 데이터 값으로 치환
데이터셋 특성상 서로 이웃하고 있는 데이터끼리 유사성을 가질 가능성이 높다.  
앞이나 뒤 값으로 치환해주는 것이 좋다.
fillna(method='ffill')옵션 이용

In [28]:
import seaborn as sns

df = sns.load_dataset('titanic')
# embarked열의 NaN 출력
print(df['embarked'][825:830])

# NaN값을 인접 데이터로 채워주기
df['embarked'].fillna(method='ffill', inplace=True)
print(df['embarked'][825:830])

825      Q
826      S
827      C
828      Q
829    NaN
Name: embarked, dtype: object
825    Q
826    S
827    C
828    Q
829    Q
Name: embarked, dtype: object

# 2. 중복데이터 처리
> * **duplicated()** : 각 행의 중복 여부를 나타내는 boolean 시리즈 반환  
중복이면 True, 중복이 아니면 False 반환한다.
> * **drop_duplicates()** : 중복데이터 제거

In [37]:
import pandas as pd

df = pd.DataFrame({
    'c1': ['a','a','b','a','b'],
    'c2': [1,1,1,2,2],
    'c3': [1,1,2,2,2]
})

print(df)

# 데이터프레임 전체 행 데이터 중에서 중복값 찾기
df_dup = df.duplicated()
print(df_dup)

# 특정 열(시리즈)에서 중복값 찾기
col_dup = df['c2'].duplicated()
print(col_dup)

# 중복 데이터 제거  
df2 = df.drop_duplicates()
print(df2)

# 중복데이터 제거 열 속성 기준으로 제거 가능
df3 = df.drop_duplicates(subset=['c2','c3'])
print(df3)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
0    False
1     True
2    False
3    False
4    False
dtype: bool
0    False
1     True
2     True
3    False
4     True
Name: c2, dtype: bool
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

# 3. 데이터 표준화

### 3-1 ) 단위 환산
* 마일, 야드, 온스 -> 미터, 평, 그램
* 'mpg'데이터 활용
* 1마일 == 1.60934km, 1캘런 == 3.78541리터, 1mpg == 0.425km/L

In [71]:
import pandas as pd

# 데이터셋 준비
df = pd.read_csv('./auto-mpg.csv',header=None)
df.columns = ['mpg', 'cylinders', 'displacement','horsepower','weight','acceleration','model year','origin','name']
print(df.head())

# mpg(mile per gallon)  ->  kpl(kilometer per liter)로 반환
# mpg_to_kpl = 0.425
mpg_to_kpl = 1.60934/3.78541

# mpg * 0.425 결과를 새로운 열(kpl)에 추가
df['kpl'] = df['mpg'] * 0.425
# kpl열을 소수점 아래 둘째자리에서 반올림
df['kpl'] = df['kpl'].round(2)
print(df.head())

    mpg  cylinders  displacement horsepower  weight  acceleration  model year
0  18.0          8         307.0      130.0  3504.0          12.0          70  \
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70
3  16.0          8         304.0      150.0  3433.0          12.0          70
4  17.0          8         302.0      140.0  3449.0          10.5          70

   origin                       name
0       1  chevrolet chevelle malibu
1       1          buick skylark 320
2       1         plymouth satellite
3       1              amc rebel sst
4       1                ford torino
    mpg  cylinders  displacement horsepower  weight  acceleration  model year
0  18.0          8         307.0      130.0  3504.0          12.0          70  \
1  15.0          8         350.0      165.0  3693.0          11.5          70
2  18.0          8         318.0      150.0  3436.0          11.0          70
3  16.0          8         304.0      150.0  3433.0          12.0          70
4  17.0          8         302.0      140.0  3449.0          10.5          70

   origin                       name   kpl
0       1  chevrolet chevelle malibu  7.65
1       1          buick skylark 320  6.38
2       1         plymouth satellite  7.65
3       1              amc rebel sst  6.80
4       1                ford torino  7.22

### 3-2) 자료형 변환
> * 숫자가 문자열(string)일 경우, 숫자형(float or int)로 변환해야한다.
> * dtypes 속성을 사용하여 데이터프레임을 구성하는 각 열의 자료형을 확인한다. (df.info()도 사용 가능)
> * horsepower(엔진 출력) -> 숫자형
> * model year(출시연도), origin(출시국가) -> 범주형

In [72]:
# transfer horsepower dtypes object to float

import pandas as pd

# 데이터셋 준비
df = pd.read_csv('./auto-mpg.csv',header=None)
df.columns = ['mpg', 'cylinders', 'displacement','horsepower','weight','acceleration','model year','origin','name']
print(df.dtypes)  # horsepower 중 문자열 '?'이 포함되어 object로 인식된다.

# horsepower 열의 고유값 확인, '?'포함 확인
print(df['horsepower'].unique())

# 누락데이터 ("?") 삭제
import numpy as np
df['horsepower'].replace('?', np.nan, inplace=True)  # '?' -> np.nan으로 변경
df.dropna(subset=['horsepower'], axis=0, inplace=True) # 누락 데이터 행 삭제
df['horsepower'] = df['horsepower'].astype('float') # 문자열 -> 실수형

# horsepower 열의 자료형 확인
print("\n")
print("==================horsepower 자료형=====================")
print(df['horsepower'].dtypes)

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight          float64
acceleration    float64
model year        int64
origin            int64
name             object
dtype: object
['130.0' '165.0' '150.0' '140.0' '198.0' '220.0' '215.0' '225.0' '190.0'
 '170.0' '160.0' '95.00' '97.00' '85.00' '88.00' '46.00' '87.00' '90.00'
 '113.0' '200.0' '210.0' '193.0' '?' '100.0' '105.0' '175.0' '153.0'
 '180.0' '110.0' '72.00' '86.00' '70.00' '76.00' '65.00' '69.00' '60.00'
 '80.00' '54.00' '208.0' '155.0' '112.0' '92.00' '145.0' '137.0' '158.0'
 '167.0' '94.00' '107.0' '230.0' '49.00' '75.00' '91.00' '122.0' '67.00'
 '83.00' '78.00' '52.00' '61.00' '93.00' '148.0' '129.0' '96.00' '71.00'
 '98.00' '115.0' '53.00' '81.00' '79.00' '120.0' '152.0' '102.0' '108.0'
 '68.00' '58.00' '149.0' '89.00' '63.00' '48.00' '66.00' '139.0' '103.0'
 '125.0' '133.0' '138.0' '135.0' '142.0' '77.00' '62.00' '132.0' '84.00'
 '64.00' '74.00' '116.0' '82.00']


==================horsepower 자료형=====================
float64

In [73]:
# transfer origin dtypes int to object
print(df['origin'].unique())

# 정수형 데이터를 문자형 데이터로 변환
df['origin'].replace({
    1: 'USA',
    2: 'EU',
    3: 'JPN'
}, inplace=True)

# origin열의 고유값과 자료형 확인
print(df['origin'].unique())
print(df['origin'].dtypes)  # object

# origin열은 3개의 국가이름이 반복된다. 고유값이 반복적으로 나타나는 경우 범주형(category)가 효율적이다.
# astype('category') 메소드를 사용하면 범주형 데이터로 변환.
# 범주형 -> 문자열로 변환하려면 astype('str')메소드를 사용한다.

df['origin'] = df['origin'].astype('category')
print(df['origin'].dtypes)

[1 3 2]
['USA' 'JPN' 'EU']
object
category

In [74]:
# model year열의 정수형 > 범주형으로 변환
print(df['model year'].sample(3))
df['model year'] = df['model year'].astype('category')
print(df['model year'].sample(3))

9      70
351    81
118    73
Name: model year, dtype: int64
38     71
261    78
62     72
Name: model year, dtype: category
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]

# 4. 범주형(카테고리) 데이터 처리

### 4-1) 구간 분할
> * 연속 데이터를 그대로 사용하기보다는 일정한 구간(bin)으로 나누어 분석하는 것이 효율적이다.
> * 구간분할(binning) : 연속 변수를 일정한 구간으로 나누고, 각 구간을 범주형 이산 변수로 나누는 과정
> * 판다스 cut()를 이용하면 연속 데이터를 여러 구간으로 나누고 범주형 데이터로 변환할 수 있다.

powerhorse의 output을 숫자로 표시하는 대신 '저출력', '보통출력', '고출력' 등 구간으로 나누어 표시  
3개의 구간으로 구분하려면 4개의 경계값이 필요하다.

In [94]:
import pandas as pd
import numpy as np

df = pd.read_csv('./auto-mpg.csv', header=None)
df.columns = ['mpg', 'cylinders', 'displacement','horsepower','weight','acceleration','model year','origin','name']

# horsepower의 열데이터 누락('?') 삭제하고 실수형으로 변환
df['horsepower'].replace('?', np.nan, inplace=True)
df.dropna(subset = ['horsepower'], axis=0, inplace=True)
df['horsepower'] = df['horsepower'].astype('float')

# np.histogram 함수로 3개의 bin으로 나누는 경계값의 리스트 구하기
count, bin_dividers = np.histogram(df['horsepower'], bins=3)  
print(bin_dividers) 

# 3개의 bin에 이름 지정
bin_names = ['저출력', '보통출력', '고출력']

# pd.cut()로 각 데이터를 3개의 bin에 할당
# bin_dividers == 경계값의 리스트, bins옵션에 할당하고 각 구간의 이름(bin_names)을 labels 옵션에 할당한다.
df['hp_bin'] = pd.cut(x=df['horsepower'],  # 데이터 배열
                     bins=bin_dividers,    # 경계값 리스트
                     labels=bin_names,     # bin 이름
                     include_lowest=True)  # 첫 경계값 포함

# horsepower 열, hp_bin 열의 첫 15행 출력
print(df[['horsepower', 'hp_bin']].head(15))

[ 46.         107.33333333 168.66666667 230.        ]
    horsepower hp_bin
0        130.0   보통출력
1        165.0   보통출력
2        150.0   보통출력
3        150.0   보통출력
4        140.0   보통출력
5        198.0    고출력
6        220.0    고출력
7        215.0    고출력
8        225.0    고출력
9        190.0    고출력
10       170.0    고출력
11       160.0   보통출력
12       150.0   보통출력
13       225.0    고출력
14        95.0    저출력

### 4-2) 더미 변수
> * 범주형 데이터를 회귀분석 등 머신러닝 알고리즘에 바로 사용할 수 없는 경우가 있는데, 컴퓨터가 인식 가능한 입력값으로 변환해야한다.
> * 0 또는 1로 표현되는 더미변수를 사용한다.
> * 0과 1은 수의 크고 작음이 아니라 feature이 있는지 없는지 여부 표시
> * 해당 특성이 있으면 1, 없으면 0 == 원핫벡터 (범주형 데이터를 컴퓨터가 인식할 수 있도록)

In [114]:
count, bin_dividers = np.histogram(df['horsepower'], bins=3)
bin_names = ['저출력', '보통출력', '고출력']

# pd.cut()로 각 데이터를 3개의 bin에 할당
# bin_dividers == 경계값의 리스트, bins옵션에 할당하고 각 구간의 이름(bin_names)을 labels 옵션에 할당한다.
df['hp_bin'] = pd.cut(x=df['horsepower'],  # 데이터 배열
                     bins=bin_dividers,    # 경계값 리스트
                     labels=bin_names,     # bin 이름
                     include_lowest=True)  # 첫 경계값 포함

# hp_bin 열의 범주형 데이터를 더미변수로 변환
horsepower_dummies = pd.get_dummies(df['hp_bin'], dtype='int')
print(horsepower_dummies.head(15))

    저출력  보통출력  고출력
0     0     1    0
1     0     1    0
2     0     1    0
3     0     1    0
4     0     1    0
5     0     0    1
6     0     0    1
7     0     0    1
8     0     0    1
9     0     0    1
10    0     0    1
11    0     1    0
12    0     1    0
13    0     0    1
14    1     0    0

#### sklearn을 이용해 원핫인코딩을 편리하게 처리할 수 있다.
df의 'hp_bin'열에 들어있는 범주형 데이터를 0,1을 원소로 갖는 원핫벳터로 변환한다. -> 결괴 : 희소행렬(sparse matrix)로 변환된다.

In [116]:
# 1차원 벡터를 2차원 벡터로 변환, 다시 희소 행렬로 변환한다.
# 희소행렬은 (행, 열) 좌표와 값 형태로 정리된다.
# (0,1)은 0행의 1열 위치를 말하고, 데이터 값은 숫자 1,0이 입력된다.

from sklearn import preprocessing

# 전처리를 위한 encoder 객체 만들기
label_encoder = preprocessing.LabelEncoder()   # label encoder 생성
onehot_encoder = preprocessing.OneHotEncoder() # one hot encoder 생성

# label encoder로 문자열 범주 -> 숫자형 범주로 변환
onehot_labeled = label_encoder.fit_transform(df['hp_bin'].head(15))
print(onehot_labeled)
print(type(onehot_labeled))

# 2차원 행렬로 형태 변경
onehot_reshaped = onehot_labeled.reshape(len(onehot_labeled), 1)
print(onehot_reshaped)
print(type(onehot_reshaped))

# 희소행렬로 변환
onehot_fitted = onehot_encoder.fit_transform(onehot_reshaped)
print(onehot_fitted)
print(type(onehot_fitted))

[1 1 1 1 1 0 0 0 0 0 0 1 1 0 2]
<class 'numpy.ndarray'>
[[1]
 [1]
 [1]
 [1]
 [1]
 [0]
 [0]
 [0]
 [0]
 [0]
 [0]
 [1]
 [1]
 [0]
 [2]]
<class 'numpy.ndarray'>
  (0, 1)	1.0
  (1, 1)	1.0
  (2, 1)	1.0
  (3, 1)	1.0
  (4, 1)	1.0
  (5, 0)	1.0
  (6, 0)	1.0
  (7, 0)	1.0
  (8, 0)	1.0
  (9, 0)	1.0
  (10, 0)	1.0
  (11, 1)	1.0
  (12, 1)	1.0
  (13, 0)	1.0
  (14, 2)	1.0
<class 'scipy.sparse._csr.csr_matrix'>

# 5. 정규화
* 각 열의 데이터를 해당 열의 최대값으로 나누면 -> 정규화 결과 최대값은 1이다.

In [133]:
# 데이터셋 준비

import pandas as pd
import numpy as np

df = pd.read_csv('./auto-mpg.csv',header=None)
df.columns = ['mpg', 'cylinders', 'displacement','horsepower','weight','acceleration','model year','origin','name']

# horsepower열의 누락데이터 '?' 삭제, 실수형으로 변환
df['horsepower'].replace('?', np.nan, inplace=True)
df.dropna(subset=['horsepower'], inplace=True)
df['horsepower'] = df['horsepower'].astype('float')

# horsepower 열의 통계 요약 정보로 max 확인
print(df.horsepower.describe())
print('\n')

# horsepower 열의 최대값의 절대값으로 모든 데이터를 나눠 저장한다.
df.horsepower = df.horsepower/abs(df.horsepower.max())

count    392.000000
mean     104.469388
std       38.491160
min       46.000000
25%       75.000000
50%       93.500000
75%      126.000000
max      230.000000
Name: horsepower, dtype: float64

In [138]:
# 각 열 데이터에서 해당 열의 최소값을 뺀 값을 분자로, 해당 열의 max-min을 분모로 하는 수를 계산하면 가장 큰 값은 역시 1이다.
# 'horsepower'열의 최대값은 230, 최소값은 46이다.
# max - min 인 184을(230-46) 이용하여 정규화하면 0~1 사이 범위로 변환된다.

print(df.horsepower.describe())
print('\n')

# horsepower 열의 최대값의 절대값으로 모든 데이터를 나눠서 저장
min_x = df.horsepower - df.horsepower.min()
min_max = df.horsepower.max() - df.horsepower.min()
df.horsepower = min_x / min_max

print(df.horsepower.head())
print('\n')
print(df.horsepower.describe())

count    392.000000
mean       0.317768
std        0.209191
min        0.000000
25%        0.157609
50%        0.258152
75%        0.434783
max        1.000000
Name: horsepower, dtype: float64


0    0.456522
1    0.646739
2    0.565217
3    0.565217
4    0.510870
Name: horsepower, dtype: float64


count    392.000000
mean       0.317768
std        0.209191
min        0.000000
25%        0.157609
50%        0.258152
75%        0.434783
max        1.000000
Name: horsepower, dtype: float64

# 6. 시계열 데이터

### 6-1) 다른 자료형 -> 시계열 객체로 변환
* pandas는 다른 자료형으로 저장된 시간 데이터 -> pandas 시계열 객체인 Timestamp로 변환하는 함수를 제공한다.
* **to_datetime()** 함수를 사용하면 문자열 등 다른 자료형을 pandas Timestamp를 나타내는 datetime64로 변환 가능하다.

In [1]:
# 문자열(시리즈 객체)을 판다스 Timestamp로 변환

# 데이터 준비하기
import pandas as pd

df = pd.read_csv('./stock-data.csv')

# Date열의 문자열 확인하기
print(df.head())
print('\n')
print(df.info())

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548
4  2018-06-26  10800  10900  11000  10700   63039


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    20 non-null     object
 1   Close   20 non-null     int64
 2   Start   20 non-null     int64
 3   High    20 non-null     int64
 4   Low     20 non-null     int64
 5   Volume  20 non-null     int64
dtypes: int64(5), object(1)
memory usage: 1.1+ KB
None

In [15]:
# new_Date열 추가하기 (열의 각 요소는 timestamp 속성을 가진다.)

df['new_Date'] = pd.to_datetime(df['Date'])  # df에 새로운 열 new_Date 추가
print(df.info())
print('\n')
print("====== 새로운 열의 요소 타입 : ",type(df['new_Date'][0]),"======")

# new_Date열을 df의 행 인덱스로 설정하고, Date열을 제거한다
# => 시계열값을 행 인덱스로 지정하면 판다스는 DatetimeIndex로 저장한다.
# 시계열 인덱스 클래스를 지원하기 때문에 시간 순서에 맞추어 인덱싱 또는 슬라이싱 하기 편하다.
df.set_index('new_Date', inplace=True)
df.drop('Date',axis=1,inplace=True)
df

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 20 entries, 2018-07-02 to 2018-06-01
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      20 non-null     object
 1   Close     20 non-null     int64
 2   Start     20 non-null     int64
 3   High      20 non-null     int64
 4   Low       20 non-null     int64
 5   Volume    20 non-null     int64
 6   new_Date  20 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(5), object(1)
memory usage: 1.8+ KB
None


====== 새로운 열의 요소 타입 :  <class 'pandas._libs.tslibs.timestamps.Timestamp'> ======

            Close  Start   High    Low  Volume
new_Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039
2018-06-25  11150  11400  11450  11000   55519
2018-06-22  11300  11250  11450  10750  134805
2018-06-21  11200  11350  11750  11200  133002
2018-06-20  11550  11200  11600  10900  308596
2018-06-19  11300  11850  11950  11300  180656
2018-06-18  12000  13400  13400  12000  309787
2018-06-15  13400  13600  13600  12900  201376
2018-06-14  13450  13200  13700  13150  347451
2018-06-12  13200  12200  13300  12050  558148
2018-06-11  11950  12000  12250  11950   62293
2018-06-08  11950  11950  12200  11800   59258
2018-06-07  11950  12200  12300  11900   49088
2018-06-05  12150  11800  12250  11800   42485
2018-06-04  11900  11900  12200  11700   25171
2018-06-01  11900  11800  12100  11750   32062

In [20]:
# Timestamp를 Period로 변환
# ( to_period()를 이용하면 일정한 기간을 나타내는 Period객체로 Timestamp객체를 변환할 수 있다. )
# ( freq 옵션에 기준이 되는 시간을 설정한다. )
import pandas as pd

# 날짜 형식의 문자열로 구성되는 리스트 정의
dates = ['2019-01-01', '2020-03-01', '2021-06-01']

# 문자열의 배열(시리즈 객체)를 판다스 Timestamp로 변환
ts_dates = pd.to_datetime(dates)
print(ts_dates)

# Timestamp를 Period로 변환
print('==== Timestamp  =>  Period ====')
pr_day = ts_dates.to_period(freq='D')
print(pr_day)
pr_month = ts_dates.to_period(freq='M')
print(pr_month)
pr_year = ts_dates.to_period(freq='A')
print(pr_year)

DatetimeIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)
==== Timestamp  =>  Period ====
PeriodIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='period[D]')
PeriodIndex(['2019-01', '2020-03', '2021-06'], dtype='period[M]')
PeriodIndex(['2019', '2020', '2021'], dtype='period[A-DEC]')

### 시계열 데이터의 종류
* D : day (1일)
* W : week (1주)
* M : month end (월말)
* MS : month begin (월초)
* Q : quarter end (분기말)
* QS : quarter begin (분기초)
* A : year end (연말)
* AS : year begin (연초)
* B : business day (휴일 제외)
* H : hour (1시간)
* T : minute (1분)
* S : second (1초)
* L : millisecond (1/1,000초)
* U : microsecond (1/1,000,000초)
* N : nanosecond (1/1,000,000,000초)

### 6-2) 시계열 데이터 만들기
> Timestamp 배열
판다스 date_range()를 사용하면 Timestamp(여러개의 날짜)가 들어있는 배열 형태의 시계열 데이터를 만들 수 있다
<br> ~= 파이썬 range()로 숫자 배열을 만드는 것과 비슷하다.

> Period 배열
판다스 period_range()를 사용하면 Period(여러개의 기간)이 들어있는 시계열 데이터를 만들 수 있다.

# Timestamp 배열 만들기

In [27]:
import pandas as pd

ts_ms = pd.date_range(start='2019-01-01', # 날짜 범위 시작
                     end=None,            # 날짜 범위 끝
                     periods=6,           # 생성할 Timestamp 개수
                     freq='MS',           # 시간 간격(MS : 월의 시작일)
                     tz='Asia/Seoul')     # 시간대(timezone)
print(ts_ms)

DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-02-01 00:00:00+09:00',
               '2019-03-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-05-01 00:00:00+09:00', '2019-06-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [23]:
# freq 옵션을 사용하여 시간 간격 다르게 설정하기

# 월 간격, 월의 마지막 날 기준
ts_me = pd.date_range('2019-01-01', periods=6,
                     freq='M',         # 시간 간격(M: 월의 마지막 날)
                     tz='Asia/Seoul')  # 시간대(timezone)
print(ts_me)
print('\n')

# 분기(3개월)단위, 월의 마지막날 기준
ts_3m = pd.date_range(start='2019-01-01', periods=6,
                     freq='3M',
                     tz='Asia/Seoul')
print(ts_3m)

DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-02-28 00:00:00+09:00',
               '2019-03-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-05-31 00:00:00+09:00', '2019-06-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='M')


DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-07-31 00:00:00+09:00', '2019-10-31 00:00:00+09:00',
               '2020-01-31 00:00:00+09:00', '2020-04-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='3M')

# Period 배열

In [26]:
import pandas as pd

# Period 배열 만들기 - 1개월 길이
pr_m = pd.period_range(start='2019-01-01', # 날짜 범위 시작
                      end=None,            # 날짜 범위 끝
                      periods=3,           # 생성할 Period 개수
                      freq='M')            # 기간의 길이 (M: 월)
print(pr_m)

PeriodIndex(['2019-01', '2019-02', '2019-03'], dtype='period[M]')

In [30]:
# freq 옵션을 활용하여 시간 간격 다르게 하기

# 1시간 길이
pr_h = pd.period_range(start='2019-01-01',
                      end=None,
                      periods=3,
                      freq='H')
print(pr_h)
print('\n')
# 2시간 길이
pr_2h = pd.period_range(start='2019-01-01',
                      end=None,
                      periods=3,
                      freq='2H')
print(pr_2h)

PeriodIndex(['2019-01-01 00:00', '2019-01-01 01:00', '2019-01-01 02:00'], dtype='period[H]')


PeriodIndex(['2019-01-01 00:00', '2019-01-01 02:00', '2019-01-01 04:00'], dtype='period[2H]')

### 6-3) 시계열 데이터 활용

# 날짜 데이터 분리

In [36]:
# 데이터 불러오기
import pandas as pd
df = pd.read_csv('./stock-data.csv')
df['new_Date'] = pd.to_datetime(df['Date'])  # 새로운 열 추가

# dt 속성을 이용하여 new_Date열의 연-월-일 정보를 년, 월, 일로 구분
df['Year'] = df['new_Date'].dt.year
df['Month'] = df['new_Date'].dt.month
df['Day'] = df['new_Date'].dt.day
print(df.head())
print('\n')
# Timestamp를 Period로 변환하여 연-월-일 표기 변경하기
df['Date_yr'] = df['new_Date'].dt.to_period(freq='A')
df['Date_m'] = df['new_Date'].dt.to_period(freq='M')
print(df.head())

         Date  Close  Start   High    Low  Volume   new_Date  Year  Month  Day
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02  2018      7    2
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29  2018      6   29
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28  2018      6   28
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018      6   27
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26  2018      6   26


         Date  Close  Start   High    Low  Volume   new_Date  Year  Month
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02  2018      7  \
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29  2018      6
2  2018-06-28  10400  10900  10950  10150  155769 2018-06-28  2018      6
3  2018-06-27  10900  10800  11050  10500  133548 2018-06-27  2018      6
4  2018-06-26  10800  10900  11000  10700   63039 2018-06-26  2018      6

   Day Date_yr   Date_m
0    2    2018  2018-07
1   29    2018  2018-06
2   28    2018  2018-06
3   27    2018  2018-06
4   26    2018  2018-06

# 날짜 인덱스 활용

In [51]:
# 판다스 Timestamp를 날짜 인덱스로 지정하기
import pandas as pd

df = pd.read_csv('./stock-data.csv')
df['new_Date'] = pd.to_datetime(df['Date'])
df.set_index('new_Date', inplace=True)  # 행 인덱스로 지정

df.head()

                  Date  Close  Start   High    Low  Volume
new_Date
2018-07-02  2018-07-02  10100  10850  10900  10000  137977
2018-06-29  2018-06-29  10700  10550  10900   9990  170253
2018-06-28  2018-06-28  10400  10900  10950  10150  155769
2018-06-27  2018-06-27  10900  10800  11050  10500  133548
2018-06-26  2018-06-26  10800  10900  11000  10700   63039

In [52]:
# Timestamp 객체로 표시된 두 날짜 사이의 시간 간격을 구할 수 있다.
# 시간 간격 계산. 최근 180일 ~ 189일 사이의 값들만 선택하기
today = pd.to_datetime('2018-12-25')            # 기준일 생성
df['time_delta'] = today - df.index             # 날짜 차이 계산
df.set_index('time_delta', inplace=True)        # 행 인덱스로 지정
df_180 = df['180 days':'189 days']
print(df_180)

                  Date  Close  Start   High    Low  Volume
time_delta
180 days    2018-06-28  10400  10900  10950  10150  155769
181 days    2018-06-27  10900  10800  11050  10500  133548
182 days    2018-06-26  10800  10900  11000  10700   63039
183 days    2018-06-25  11150  11400  11450  11000   55519
186 days    2018-06-22  11300  11250  11450  10750  134805
187 days    2018-06-21  11200  11350  11750  11200  133002
188 days    2018-06-20  11550  11200  11600  10900  308596
189 days    2018-06-19  11300  11850  11950  11300  180656